# 2.3. 用户模式回调函数

为了执行像调用应用程序定义的钩子，提供事件通知，与用户模式交换数据等任务，
Win32k 经常需要调用回用户模式。这些调用通常称为用户模式回调函数。
这种机制本身实现在由 NT 执行体导出的 KeUserModeCallback（__清单 3__），
而且操作很像反向的系统调用。

```
NTSTATUS KeUserModeCallback (
     IN ULONG ApiNumber,
     IN PVOID InputBuffer,
     IN ULONG InputLength,
     OUT PVOID *OutputBuffer,
     IN PULONG OutputLength );
```

__清单 3__ 用户模式回调函数

当 Win32k 调用用户模式回调时，它会带上它想调用用户模式函数的 ApiNumber
调用 KeUserModeCallback。这里的 ApiNumber 是对函数指针表
（USER32!apfnDispatch）的索引。该表的地址在 USER32.dll
初始化的时候会复制到进程的进程环境块（PEB.KernelCallbackTable）里。
Win32k 提供给各个回调函数的的输入参数填充在 InputBuffer，
用户模式返回的输出在 OutputBuffer。

```
0:004> dps poi($peb+58)
00000000‘77b49500 00000000‘77ac6f74       USER32!_fnCOPYDATA
00000000‘77b49508 00000000‘77b0f760       USER32!_fnCOPYGLOBALDATA
00000000‘77b49510 00000000‘77ad67fc       USER32!_fnDWORD
00000000‘77b49518 00000000‘77accb7c       USER32!_fnNCDESTROY
00000000‘77b49520 00000000‘77adf470       USER32!_fnDWORDOPTINLPMSG
00000000‘77b49528 00000000‘77b0f878       USER32!_fnINOUTDRAG
00000000‘77b49530 00000000‘77ae85a0       USER32!_fnGETTEXTLENGTHS
00000000‘77b49538 00000000‘77b0fb9c       USER32!_fnINCNTOUTSTRING
```

__清单 4__ USER32.dll 中的用户模式回调函数派遣表

调用系统调用时，为了保存当前的线程情境并且在返回到用户模式时能恢复寄存器，
nt!KiSystemService 或者 nt!KiFastCallEntry 会在内核线程栈存储一个自陷帧。
为了在用户模式回调函数中切换回用户模式，KeUserModeCallback 首先
使用由线程对象保存的自陷帧信息复制输入缓冲区到用户模式栈。
然后创建一个 EIP 设置为 ntdll!KiUserCallbackDispatcher 的新自陷帧，
替换线程对象的 TrapFrame 指针，并最终调用 nt!KiServiceExit
来将执行转移到用户模式回调派遣函数。

由于用户模式回调函数需要空间存储像自陷帧的线程状态信息，为了保证足够的空间，
Windows XP 和 2003 都会增加内核栈。然而，
因为递归调用回调函数能很快地消耗完栈空间，Windwos Vista 和 Windows 7
采取的是为每一个用户模式回调函数创建新的内核线程栈。
为了记录像之前的栈之类的信息，Windows 在栈的底部保留了一个
KSTACK\_AREA（__清单 5__）结构的空间，构造的自陷帧紧随其后。

```
kd> dt nt!_KSTACK_AREA
    +0x000 FnArea             : _FNSAVE_FORMAT
    +0x000 NpxFrame           : _FXSAVE_FORMAT
    +0x1e0 StackControl       : _KERNEL_STACK_CONTROL
    +0x1fc Cr0NpxState        : Uint4B
    +0x200 Padding            : [4] Uint4B
kd> dt nt!_KERNEL_STACK_CONTROL -b
    +0x000 PreviousTrapFrame : Ptr32
    +0x000 PreviousExceptionList : Ptr32
    +0x004 StackControlFlags : Uint4B
    +0x004 PreviousLargeStack : Pos 0, 1 Bit
    +0x004 PreviousSegmentsPresent : Pos 1, 1 Bit
    +0x004 ExpandCalloutStack : Pos 2, 1 Bit
    +0x008 Previous           : _KERNEL_STACK_SEGMENT
       +0x000 StackBase           : Uint4B
       +0x004 StackLimit          : Uint4B
       +0x008 KernelStack         : Uint4B
       +0x00c InitialStack        : Uint4B
       +0x010 ActualLimit         : Uint4B
```

__清单 5__ 栈区与栈控制结构

当用户模式回调函数完成时，它会调用 NtCallbackReturn（__清单 6__）
来继续在内核中的执行。该函数复制回调函数的结果到原来的内核栈中，
并使用存储在 KERNEL\_STACK\_CONTROL 结构中的信息恢复原来的自陷帧
（PreviousTrapFrame）与内核栈。在跳转回它离开的地方
（在 nt!KiCallUserMode 里）之前，内核回调栈会被删除。

```
NTSTATUS NtCallbackReturn (
     IN PVOID Result OPTIONAL,
     IN ULONG ResultLength,
     IN NTSTATUS Status );
```

__清单 6__ NtCallbackReturn

由于递归或者嵌套的回调函数可能造成内核栈无限增长（XP）或者创建任意数量的栈，
内核会为线程对象结构（KTHREAD->CallbackDepth）中每一个运行的线程
记录回调函数的深度（用户模式回调函数消耗的总内核栈空间）。对于每一个回调函数，
线程栈已经使用的字节数（栈底 - 栈指针）会加到 CallbackDepth 变量上。
当内核尝试迁移到新的栈时，nt!KiMigrateToNewKernelStack 会确保
总的 CallbackDepth 绝不会超过 0xC000 字节，
否则返回一个 STATUS\_STACK\_OVERFLOW 错误代码。
